Revit 2027 API
ModelPath.ServerPath Property
 Whether this path is a server path (as opposed to a file path or cloud path)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ServerPath { get; }
Public ReadOnly Property ServerPath As Boolean
	Get
public:
property bool ServerPath {
	bool get ();
}
member ServerPath : bool with get
Property Value
Boolean
See Also
Reference
ModelPath Class
Autodesk.Revit.DB Namespace